export enum UserLevel {
  /**
   * 👑 مدیر کل
   * - فقط یک نفر
   * - دسترسی کامل به تمام داده‌ها و کاربران
   * - ایجاد و مدیریت سوپرادمین‌ها
   * - کنترل ACL و تنظیمات همه
   */
  MANAGER = 1,

  /**
   * 🛡 سوپرادمین
   * - هر سوپرادمین نماینده یک شرکت است
   * - زیرمجموعه‌اش شامل مالک‌ها، شعبه‌ها، تکنسین‌ها، راننده‌هاست
   * - می‌تواند داده‌های مربوط به خودش را مدیریت کند (در صورت مجاز بودن توسط مدیر کل)
   */
  SUPER_ADMIN = 2,


  /**
   * 🏬 مدیر نمایندگی
   * - مسئول یک شعبه خاص از شرکت
   * - معمولا وظیفه بررسی گزارش‌ها و هماهنگی‌ها را دارد
   */
  BRANCH_MANAGER = 3,


  
  /**
   * 👤 مالک
   * - زیرمجموعه سوپرادمین
   * - صاحب دستگاه‌هاست
   * - می‌تواند تکنسین‌ها و دستگاه‌های خودش را مدیریت کند
   */
  OWNER = 4,


  /**
   * 👷 تکنسین
   * - زیرمجموعه مالک یا نمایندگی
   * - فقط به دستگاه‌هایی که به او اختصاص داده شده دسترسی دارد
   */
  TECHNICIAN = 5,

  /**
   * 🚚 راننده / اپراتور
   * - مسئول برداشت یا توزیع فیزیکی
   * - در مسیرها، گزارش‌های GPS و برداشت آب یا یخ فعال است
   */
  DRIVER = 6,
}
